src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПоказатьДиаграмму(Команда)

    АдресДанных = ПоместитьДанныеВоХранилищеНаСервере();
    
    ПараметрыФормы = Новый Структура("АдресДанных, ТекущийГод", АдресДанных, Объект.Дата);
    
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтаФорма);
    
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоХранилищеНаСервере()
    ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить(); 
    Возврат ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
КонецФункции




&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	РассчитатьДниСтроки(Элементы.ОтпускаСотрудников.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДниСтроки(СтрокаТЧ)
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
		КоличествоДней = (КонецДня(СтрокаТЧ.ДатаОкончания) - НачалоДня(СтрокаТЧ.ДатаНачала) + 1) / 86400;
		СтрокаТЧ.Продолжительность = Макс(Цел(КоличествоДней), 0);
	Иначе
		СтрокаТЧ.Продолжительность = 0;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПересчитатьВсеСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПересчитатьВсеСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВсеСтрокиНаСервере()
	Для Каждого Стр Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Стр.ДатаНачала) И ЗначениеЗаполнено(Стр.ДатаОкончания) Тогда
			Стр.Продолжительность = (КонецДня(Стр.ДатаОкончания) - НачалоДня(Стр.ДатаНачала) + 1) / 86400;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
